[
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 1,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 1 OF 14  PURCHASE CONTRACT  Contract No. SAMPLE    THIS PURCHASE CONTRACT (the “ Contract ”) entered into as of __________ by and between  MERCY CORPS, a State of Washington, U.S.A. nonprofit corporation having its principal office in Portland, Oregon, U.S.A. (“ Mercy Corps ”) and _____________________________ (\" Supplier \") is  as follows:  1. Defined Terms .   Each of the following terms has the meaning given to such term on Schedule I  attached hereto:  Authorized Representative, C ontract Number, Delivery Date, Delivery Location,  Delivery Terms, Donor Terms, Goods , Packing Requirements, Pricing, and Specifications.  Other terms  are defined as specified throughout this Contract.  2. Purchase and Sale of Goods .   Supplier will sell to Mercy Corps, and Mercy Corps will purchase  and pay for, the Goods in accordance with the te rms and conditions set forth in this Contract.  3. Specifications .   The Goods must strictly comply w ith or exceed the S"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 1,
    "section": null,
    "text": "pecifications listed in  Schedule II.  No deviation, subs titution or change is permitted w ithout Mercy Corps’ prior written  consent.  4. Purchase Order Amendments .  Mercy Corps may suspend Supp lier's performance, increase or  decrease the ordered quantities, or make chang es for Mercy Corps’ reasonable business needs by  written notice to Supplier (each, a “Purchase Order Amendment \").  Unless mutually agreed, a  Purchase Order Amendment does not apply to cha nge the Goods timely and fully delivered and  accepted before the date of the Purchase Order Am endment.  If any change causes an increase or  decrease in the cost of, or the time required for, Supplier's performance, an equitable adjustment may  be made in the price or delivery schedule or both, if  such adjustment is set forth in a Purchase Order  Amendment signed by the Authorized Representative.  5. Non-Exclusivity.   This Contract is not intended to cr eate an exclusive relationship between the  parties.    6. Inspection"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 1,
    "section": null,
    "text": ", Acceptance and Rejection .     a. All Goods will be subject to Mercy Corps' insp ection and testing (which may be done by a third  party authorized by Mercy Corps), at a ny time and place, including the period of  manufacture/production/creation and before final acc eptance.  If Mercy Corps inspects or tests  at Supplier's premises, Supplier, without additio nal charge, will provide all reasonable facilities  and assistance for the safety and convenience of Mercy Corps' inspectors.  No inspection or  testing done or not done before final insp ection and acceptance will relieve Supplier from  responsibility for defects or for other failure to  meet the requirements of this Contract.   Notwithstanding any prior inspections or paymen ts made, all Goods will be subject to final  inspection and acceptance at the Delivery Location within a reasonable time after delivery (but  in no event, less than three days after the date of delivery)."
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 2,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 2 OF 14  b. Acceptance will occur only when the Authorized  Representative delivers written, signed notice  of acceptance to Supplier in the form of a goods received notice (“ GRN ”) and such notice has  been signed by Supplier’s representative.  Th e GRN must include: (1) the GRN number and  the packing slip number; (2) the Contract num ber; (3) a description of the Goods; (4) the  quantity delivered; (5) final inspection date and location; (6) quantity accepted; and (7) quantity  rejected or over-shipped.  c. If any delivery, documentation or the Goods deliv ered do not comply with all of the terms and  conditions of this Contract, Mercy Corps may do one  or more of the following: (1) reject such  nonconforming Goods, accept conforming Goods and reduce the purchase price by such  amount as Mercy Corps determines in good faith reflects the value to Mercy Corps of the  accepted Goods, (2) accept such nonconforming Go ods and reduce the purchase price b"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 2,
    "section": null,
    "text": "y such  amount as Mercy Corps determines in good faith re flects the reduced value to Mercy Corps of  such nonconforming Goods; (3) reject all Goods; and/or (4) terminate this Contract without  any further obligation on Mercy Corps’ part.  d. If any Goods are finally accepted, Mercy Corp s will only pay for the quantity accepted up to  the quantity specified in this Contract.  Merc y Corps will in no event pay for quantity above  the amount provided for in this Contract or accep ted.  Mercy Corps or its agent will hold over- shipments and non-conforming shipments at Supplier's risk and expense for a reasonable time  awaiting Supplier's instructions.  Supplier will be ar the expense of return charges, storage  charges and other expenses for over-shi pped quantities and Goods not accepted.  7. Packing .   All Goods will be prepared for shipping and delivery and will be shipped in accordance  with the Packing Requirements listed in Schedule I.  Price based on weight will include net weigh"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 2,
    "section": null,
    "text": "t  only.  Supplier will not charge Mercy Corps for p ackaging or pre-shipping costs, such as boxing,  crating, handling damage, drayage, or storage.  Supplier will mark all containers with necessary  handling and shipping information, Contract Number , date of shipment, and names of the consignee  and consignor.  A packing list, a nd other documentation required for dom estic or international transit,  regulatory clearance or identification of  the Goods will accompany each shipment.  8. Transportation, Shipment and Delivery .   Shipment/transportation will be in accordance with  the Delivery Terms, Delivery Date, and Delivery Loca tion in Schedule I.  Mercy Corps will not be  charged for shipping, delivery, loading or unloadi ng costs unless otherwise specified in the Delivery  Terms.  9. Risk of Loss .   Supplier will bear all risk of loss, dama ge, or destruction to the Goods, in whole or  in part, occurring before final acceptance by Mercy Corps at the Delivery Location; provided, "
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 2,
    "section": null,
    "text": "Mercy  Corps is responsible for any lo ss caused by its gross negligence.  10. Taxes, Duties and Expenses .     a. All taxes, duties and other governme ntal charges with respect to the  manufacture/production/creation of the Goods and the delivery of the Goods to Mercy Corps  in accordance with this Contract will be the lia bility of, and borne solely by, Supplier.  If the  law requires Mercy Corps to withhold taxes fro m payments to Supplier, Mercy Corps may  withhold those taxes and pay them to the a ppropriate taxing authority.  Mercy Corps will  deliver to Supplier an official notice for such taxes.  Mercy Corps will use reasonable efforts  to minimize any taxes withheld to the extent allowed by law."
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 3,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 3 OF 14  b. Supplier is responsible for all expenses incu rred by it in performing under this Contract.  11. Invoicing and Payment .     a. Mercy Corps will have no obligation to make a ny payment to Supplier with respect to the  Goods until final acceptance in accordance with S ection 6(b) and delivery of an invoice that  fully complies with the requirements specified  in this Contract.  Invoices may only be  submitted after Supplier receives a GRN.  I nvoices must be submitted within 60 days of  Supplier’s acceptance of a GRN.  Mercy Corps will have no obligation to pay an invoice  submitted after 60 days or to pay an invoice amount that Mercy Corps disputes in a written  notice to Supplier.  Each invoice must contain or attach the following: (1) a copy of the signed  GRN; (2) Supplier’s name and address; (3) descr iption of the Goods delivered, delivery date,  quantity, unit price and total price to be paid; (4) all information necessary for Mercy C"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 3,
    "section": null,
    "text": "orps to  implement payment (e.g., name of representa tive to address payment to, address, bank account  information as applicable for the method of pa yment); (5) the Contract Number; (6) packing  slip number; (7) taxes and duties (only if pa yable by Mercy Corps per the terms of this  Contract); (8) Delivery Location and Delivery Da te; and (9) any other information reasonably  required by Mercy Corps.  Invoices will only be deem ed received on the date they are delivered  to the Authorized Representative and in fu ll compliance with the requirements herein.  b. Mercy Corps will make payment within 30 days of receipt of Supplier's fully conforming  invoice.  Payment of an invoice will not cons titute acceptance of Goods, and is subject to  adjustment for errors, shortages, defects or ot her failure of Supplier to meet the requirements  of this Contract.  Mercy Corps may set-off am ounts owed to Mercy Corps against an amount  Mercy Corps owes to Supplier or Supplier's affiliated compan"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 3,
    "section": null,
    "text": "ies, and Mercy Corps will  provide notice to Supplier within a reasonable time after the setoff.  12. Representations, Warranties and Additional Covenants .   Supplier represents and warrants  to Mercy Corps and covenants with Mercy Corps as follows.  a. Supplier has full rights and authority to ente r into and perform its obligations under this  Contract.  Supplier’s performance will not vi olate any agreement or obligation between  Supplier and any third party.  b. The Goods and all documentation required will m eet each of the standards and specifications  set forth in this Contract.  The Goods are merchantable and fit for their intended purpose,  comply with all applicable law and are free fro m all defects in material and workmanship.  c. Supplier will deliver good and mark etable title to the Goods free a nd clear of all liens, claims,  encumbrances and interests of any other pers on, entity or government.  The Goods will not  infringe on any patent, copyright, trademark, trad e "
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 3,
    "section": null,
    "text": "secret or other proprietary right of any third  party.  d. Supplier will comply with all applicable law, re gulations and rules in the performance of its  obligations under this Contract.  e. Supplier has not, and will not, engage in transac tions with, or provide resources or support to,  individuals and organizations asso ciated with terrorism, including  those individuals or entities  that appear on the Specially Designated Nationals  and Blocked Persons List maintained by the  U.S.  Treasury (http://www.treasury.gov/resource-center/sanctions/SDN-"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 4,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 4 OF 14  List/Pages/default.aspx) or the United Nations Security designation list  (http://www.un.org/sc/committees/1267/ aq_sanctions_list.shtml ).  f. Supplier will comply with and train its employ ees in all applicable laws against bribery,  corruption, inaccurate books and records, inadequate internal controls and m oney-laundering,  including the U.S. Foreign Corrupt Practices Ac t and the UK Bribery Act.  Supplier has not  and will not offer or give any employee, agent,  or representative of Mercy Corps anything of  value to secure any business from Mercy Corps or influence such person to alter the terms,  conditions, or performance of any contract with or purchase orde r from Mercy Corps, including  but not limited to this Contract.  g. Supplier does not own, directly or indirectly, any other company that was competing for award  of this Contract.  Supplier did not seek or obtai n confidential information related to the award  of this Contract f"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 4,
    "section": null,
    "text": "rom any Mercy Corps employ ee, agent or representative.  Supplier did not  collude or conspire with any other individual or  entity to limit competition for the award of this  Contract, to set prices being offered or in any other way to interfere with free and open  competition.  h. Supplier is not owned in whole or in part, dir ectly or indirectly, by any immediate or extended  family member of any Mercy Corps employee, agent or representative, or, if so owned,  Supplier fully disclosed such relationship and any potential conflict of interest has been waived  by Mercy Corps.  i. Supplier has not engaged in, and will not e ngage in, any of the following conduct:  (A)  trafficking in persons (as defined in the Protocol  to Prevent, Suppress, and Punish Trafficking  in Persons, especially Women and Children, supplementing the UN Convention against  Transnational Organized Crime); (B) procuring a co mmercial sex act; or (C) using forced labor.  j. Supplier is not the subject or any govern"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 4,
    "section": null,
    "text": "men tal or donor investigation and has not been  debarred or suspended by any governme nt, governmental agency or donor.  k. Contractor [or supplier] understands that it is subject to Mercy Corps' Child Safeguarding,  Prevention of Sexual Exploitation and Abuse of  Beneficiaries and Community Members, Anti- Trafficking and Sexual Misc onduct policies (available at https://www.mercycorps.org/who- we-are/ethics-policies ). Contractor must report any violation or suspected violation of these  policies in relation to the Contractor's activities under this contract to Mercy Corps, which may  be done via its Integrity Hotline website ( www.mercycorps.org/integrityhotline ). Contractor  will ensure that it has the capacity to ab ide by these policies, that its employees and  subcontractors understand these policies, and that it communicates to its employees and  subcontractors the duty to report. Contractor understands and agrees that a violation of these  policies may, in addition to any oth"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 4,
    "section": null,
    "text": "er remedies available under this Contract or at law, result  in suspension or immediate termination of this C ontract and may also result in Contractor being  deemed ineligible for future contracts with Mercy Corps.   l. Independent Contractor.    The parties intend to be indepe ndent contractors.  Supplier will be  solely responsible for and ha ve control over the means, me thods, techniques, personnel and  procedures for supplying goods.  Neither party will be deemed an agent or partner of the other  party."
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 5,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 5 OF 14  13. Confidentiality .   Supplier will maintain the confidentia lity of: (i) any information Mercy Corps  provides to Supplier that Mercy Corps identifies as c onfidential; (ii) the terms and conditions of this  Contract; and (iii) nonpublic info rmation regarding Mercy Corps’ po licies and practices.  Upon Mercy  Corps’ request, Supplier will return to Mercy Co rps all confidential info rmation provided by Mercy  Corps to Supplier.  This confidentiality obligation will survive final acceptance of the Goods, payment  of the purchase price and termination of this Contract.  14. Indemnification .   Supplier will indemnify Mercy Corps and each of its officers, directors,  employees, representatives and agents (each, an “ Indemnitee ”), and hold them harmless from, any and  all losses, claims, damages, liabilities, any government or donor investigations, fines or penalties and  related expenses (including incidental and conseq uential damages and r"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 5,
    "section": null,
    "text": "easonable attorneys’ fees,  whether incurred at the investigative, trial or appe llate level or otherwise)  incurred by any Indemnitee  or asserted against any Indemnitee by any third party or by Supplier arising out of, in connection with, or as a result of this Contract, any failure by Supplier to fully perform its obligations under this Contract  or any breach by Supplier of any of its representations  and warranties under this Contract, provided that  such indemnity will not, as to any Indemnitee, be av ailable to the extent that such losses, claims,  damages, liabilities or related e xpenses resulted from the gross negligence or willful misconduct of  such Indemnitee.  This indemnity obligation will survive final acceptance of the Goods, payment of the  purchase price and termination of this Contract.  15. Termination and Remedies.   This Contract may be terminated under the following  circumstances:  a. by both Parties on mutual written agreement of the Parties;  b. by Mercy Corp"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 5,
    "section": null,
    "text": "s immediately upon written noti ce in the event Mercy Corps’ donor(s)  terminates or withdraws funding that Mercy Corps would use to pay Contractor under this  Contract;  c. by either Party due to the non-terminating Party’s br each of this Contract and failure to correct  such breach within 15 days prior notice of such breach;  d. be either Party upon written notice if a for ce majeure event, including any not reasonably  foreseeable war, insurrection, change in law or  government action or inaction, strike, natural  disaster or similar event, prevents the terminati ng Party from being able to fulfill its obligations  under this Contract; or  e. by Mercy Corps immediately upon written notice if Mercy Corps using its sole discretion  determines that Contractor has or will breach any of its warranties, covenants or representations  in this Contract, in which case Mercy Corp s may withhold any and all amounts owed to  Contractor until such breach is remedied.  In the event termination is"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 5,
    "section": null,
    "text": " due to Mercy Corp s’ breach of this Contract, by Mercy Corps for  Mercy Corps convenience, due to force majeure event, or due to loss of funding, Mercy Corps shall be  obligated to pay Contractor for its reasonable, pro -rated costs of work completed and expenses properly  incurred prior to termination.  If Mercy Corps determines that Supplier has or will breach any of its warranties, covenants or  representations in this Contract, Mercy Corps may, in addition to any othe r remedies for such breach  available at law or in equity, (i) terminate this Contr act; (ii) reject any Goods delivered; (iii) return any"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 6,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 6 OF 14  Goods already accepted and obtain full repayment for any amount paid for such Goods; (iv) if Supplier  breaches Section 10(j), withhold payment until such i nvestigation, suspension or debarment is lifted;  and (v) if Supplier breaches any of Section 10(e), (f), (g), (h) or (i), not pay for any Goods that have  been accepted but that have been consumed or othe rwise cannot be returned to Supplier and report the  breach to Mercy Corps donors and appropriate  governmental authorities.         16. Dispute Resolution .   Any unresolved dispute or claims will be settled by arbitration administered  by the International Centre for Dispute Resolution in accordance with its International Arbitration  Rules.  The number of arbitrators will be one.  Th e place of arbitration will be Portland, Oregon.  The  language of the arbitration will be English.  17. Access to Books and Records .   Mercy Corps, its donors (including, if applicable, USAID, and  the "
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 6,
    "section": null,
    "text": "Comptroller General of the United States) a nd any of their respective representatives will have  access to any books, documents, papers and records of  Supplier that are directly pertinent to this  Contract for the purpose of making audits, examina tions, excerpts and transcriptions or a period of  seven years following the completion of the Contract.  18. Additional Donor Terms and Conditions .   The Donor Terms (if any) are incorporated in this  Contract by reference and are fully binding on Supplie r and Mercy Corps.  In the event of a conflict  between the Donor Terms and this Contract or an y other document between Supplier and Mercy Corps,  the Donor Terms will prevail.  19. Miscellaneous .     a. This Contract and the rights and obligations of the parties hereto will be governed by and  construed in accordance with the laws of the St ate of Oregon (exclusive of the United Nations  Convention on Contracts for the International Sale  of Goods), without regard to the conflict of  "
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 6,
    "section": null,
    "text": "laws provisions thereof.  b. No right or obligation under this Contract (inc luding the right to receive monies due) will be  assigned without the prior written consent of Mercy Corps.  Any assignment without such  consent will be void.  Mercy Corps ma y assign its rights under this Contract.  c. All notices provided for herein will be in writi ng and will be delivered by hand or overnight  courier service, email or fax in accordance with  each party’s contact information set forth on  Schedule I.  Notices will be deemed to have b een given when received, provided that notices  sent by email or fax will be deemed received when  sent (except that, if not sent during normal  business hours for the recipient, will be deemed received at the opening of business on the next  business day for the recipient).  d. Time is of the essence of each and every obligation of Supplier under this Contract.  e. If any provision of this Contract is prohibited by or invalid under applicable law, such provi"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 6,
    "section": null,
    "text": "sion  will be ineffective only to the extent of such prohibition or invalidity without invalidating the  remainder of such provision or any re maining provisions of this Contract.  f. Except as otherwise provided above, this Contr act may be amended or modified only by a  written document signed by both parties.  This Contract constitutes the entire contract between  the parties relating to the subject matter hereof  and supersedes any and all previous Contracts  and understandings, oral or written, re lating to the subject matter hereof."
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 7,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 7 OF 14  IN WITNESS WHEREOF, this Purchase Contract h as been duly executed as of the date first written  above.    MERCY CORPS    By:    Name:    Title:    ________________________________    By:    Name:    Title:"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 8,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 8 OF 14  SCHEDULE I  Additional Terms  1. Goods:  ________________________ (the “Goods” ).  All Goods must pr ecisely comply with the  specifications attached hereto as Schedule II (the “Specifications” ).   2. Quantity: ______________________.  3. Packing Requirements :   _________________________ (the  “Packing Requirements” ).  4. Delivery Location: ______________________________  (the “Delivery Location” ).  5. Delivery Date: __________________________________  (the “Delivery Date” ).  6. Transportation and Unloading Terms: ________________________.  7. Pricing:   a. Unit Price(s):  _________________ (the  “Unit Price(s)” ).  b. Total Price:    __________________ (the  “Price”)   8. Additional Payment Terms (if any):   9. Authorized Representatives and Contact Information:    a. Mercy Corps:  Only the following Mercy Corps empl oyees are authorized to agree to any  amendment of this Contract and any Change Order:    __________________  ____________"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 8,
    "section": null,
    "text": "______  __________________  Attn:  _____________  Fax:  _____________ Email:  _____________  Only the following Mercy Corps employees are author ized to accept or reject Goods or sign on  any GRN.    __________________  __________________ __________________ Attn:  _____________  Fax:  _____________  Email:  _____________  b. Supplier:  Supplier’s authorized representative for all purposes is:"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 9,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 9 OF 14   __________________  __________________  __________________  Attn:  _____________  Fax:  _____________ Email:  _____________  10. Donor Terms : The terms and conditions attached he reto as Schedule III (the “Donor Terms”)"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 10,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 10 OF 14  SCHEDULE II  Description of the Goods and Specifications  1. Specifications for the Goods: The Goods must all strictly adhere  to the following specifications:"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 11,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 11 OF 14  SCHEDULE III    Donor Terms  Other USAID Contract Provisions Required by Law or Regulation    Mercy Corps, in accordance with donor regulations, requires certain certifications and provisions, set  forth herein, to be included in all contracts.  1. The Contractor must not engage in transactions w ith, or provide resources or support to, individuals  and organizations associated with terrorism, incl uding those individuals or entities that appear on  the Specially Designated Nationals and Blocked Persons List maintained by the U.S. Treasury  (online at: http://www.treasury.gov/resource-cente r/sanctions/SDNList/Pages/default.aspx) or the  United Nations Security designation list (online at: http://www.un.org/sc/committees/1267/aq_sanctions_list.shtml).    2. Contractor certifies that neither it nor its princi pals is presently exclude d or disqualified from  participation in this transaction by any US Government department or agency.     3. Co"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 11,
    "section": null,
    "text": "ntractor certifies that it will not and has not used  any funds received directly or indirectly from  the U.S. Government to pay any person or organi zation for influencing or attempting to influence  an officer or employee of any agency, a member of  U.S. Congress, officer or employee of Congress,  or an employee of a member of Congress in conn ection with obtaining this Contract or any other  U.S. government funded project.     4. Mercy Corps, USAID, and the Comptroller General of the United States, or any of their duly  authorized representatives, shall have access to  any books, documents, papers and records of  Contractor which are directly pertinent to th is Contract for the purpose of making audits,  examinations, excerpts and transcriptions.     5. The Contractor or its employees, or any Subcontract or or its employees, must not engage in any of  the following conduct:   (i) Trafficking in persons (as defi ned in the Protocol to Prevent,  Suppress, and Punish Trafficking  in Pe"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 11,
    "section": null,
    "text": "rsons, especially Women and Children,  supplementing the UN Convention against  Transnational Organized Crime) during the period of this Contract;  (ii) Procure a commercial sex act during the period of this Contract;  (iii) Use forced labor in the performance of the Contract; or  (iv) Commit acts that directly support or advance trafficking in persons, including the following  acts:  a. Destroying, concealing, confiscating, or otherwise denying an employee access to that  employee's identity or immigration documents;    b. Failing to provide return transportation or  pay for return transportation costs to an  employee from a country outside the Unite d States to the country from which the  employee was recruited upon the end of em ployment if requested by the employee,  unless:      exempted from the requirement to provide or pay for such return transportation by  Mercy Corps under this award; or"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 12,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 12 OF 14     the employee is a victim of human tra fficking seeking victim services or legal  redress in the country of employment or a witness in a human trafficking  enforcement action;     c. Soliciting a person for the purpose of empl oyment, or offering employment, by means  of materially false or fraudulent pretenses, representations, or promises regarding that  employment;     d. Charging employees recruitment fees ; or     e. Providing or arranging housing that fails to meet the host country housing and safety  standards.     Contractor agrees to report in a timely manner to  Mercy Corps any credible information from any  source that alleges the contractor or any sub-co ntractor has engaged in any of the prohibited  activities identified in this provision.     6. The Contractor must inform its employees worki ng under this contract in the predominant native  language of the workforce that they are afforded the employee whistleblower rights and"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 12,
    "section": null,
    "text": " protections  provided under 41 U.S.C. § 4712; and     7. Prohibition on Requiring Certain Internal Conf identiality Agreements or Statements     (a) The Contractor must not require its employees or sub-contractors to sign or comply with  internal confidentiality agreements  or statements that prohibit or otherwise restrict employees  or sub-contractors from lawfully reporting waste,  fraud, or abuse related to the performance of  this contract to Mercy Corps or to USAID’s Office of the Inspector General.    (b) The Contractor must notify current employees and sub-contractors that prohibitions and  restrictions of any preexisting internal confidentia lity agreements or statements covered by this  provision, to the extent that such prohibitions  and restrictions are inconsistent with the  prohibitions of this provision, are no longer in effect.    (c) If Mercy Corps, USAID or other authorized offi cials of the US Government determines that  the Contractor is not in compliance with the r"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 12,
    "section": null,
    "text": "equirements of this provision, Mercy Corps may,  at its sole discretion, suspend or terminate the c ontract.  Further, Mercy Corps may, at its sole  discretion, decide not pay a portion or all of  amounts invoiced or expenditures incurred, as  applicable, by the Contractor with funds provided under this contract, and also may require the  Contractor to refund a portion or all of any amount s paid to the Contractor under this contract.    (d) Definitions:    Terms in this clause will have the meaning define d in this section or as defined in 2 CFR 200.   “Internal confidentiality agreement or statemen t” means a confidentiality agreement or any  other written statement that the Contractor requi res any of its employees or sub-contractors to  sign regarding nondisclosure of recipient information, except that it does not include"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 13,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 13 OF 14  confidentiality agreements arising out of civ il litigation or confidentiality agreements that  Contractor employees or sub-contractors sign at the behest of a US government agency.     (e) The Contractor must include this provision, incl uding this paragraph (e), in subawards and sub- contracts funded under this contract.   8. Contractor must disclose, in a timely manner, in writing to the USAID Office of Inspector General  and Mercy Corps all violations of US government criminal law involving fraud, bribery or gratuity  violations potentially affecting this Contract.   Disclosures to USAID must be sent to: U.S. Agency for International Development Office of the Inspector General  P.O. Box 657  Washington, DC 200044-0657 Phone: 1-800-230-6539 or 202-712-1023  Email: ig.hotline@usaid.gov   URL: https://oig.usaid.gov/content/u said-contractor-reporting-form     9. USAID policy requires that the contractor not discriminate against any beneficia"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 13,
    "section": null,
    "text": "ries in  implementation of this contract, such as, but not  limited to, by withholding, adversely impacting,  or denying equitable access to the benefits provide d through this contract on the basis of any factor  not expressly stated in the contract. This includes, for example, race, color, religion, sex (including  gender identity, sexual orientation, and pregna ncy), national origin, disability, age, genetic  information, marital status, parental status, political  affiliation, or veteran's status. Nothing in this  provision is intended to limit the ability of the c ontractor to target activities toward the assistance  needs of certain populations as defined in the contract.    10. Fly America Act    The Fly America Act (49 U.S.C. 40118) requires that all air travel and shipments under this Contract must be made on U.S. flag carriers to th e extent service by such carriers is available. The  US Government Administrator of General Services  Administration (GSA) is authorized to issue"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 13,
    "section": null,
    "text": "  regulations for purposes of implementation. Those re gulations may be found at 41 CFR part 301,  and are hereby incorporated by re ference into this Contract.    11. Prohibition on Providing Funds to the Enemy    11.1 If the value of this Contract is USD $50,000 or more, the Contractor must—    a. Exercise due diligence to ensure that none of the funds received under this contract are provided  directly or indirectly (including  through subcontracts) to a person or entity who is actively opposing  the United States or coalition forces involved in a contingency operation in which members of the  Armed Forces are actively engaged in hostilities; (2) Terminate or void in whole or in part any sub  contract with a person or entity listed in SAM as a prohibited or restricted source pursuant to subtitle  E of Title VIII of the NDAA for FY 2015, unl ess Mercy Corps provides written approval to  continue the contract."
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 14,
    "section": null,
    "text": "Purchase Contract No: SAMPLE PAGE 14 OF 14  b. Mercy Corps has the authority to te rminate this Contract, in whole or in part, if the recipient failed  to exercise due diligence as required by paragraph (a) of this clause or otherwise violates the  requirements in paragraph (a).    11.2 Additional Access to Recipient Records    a. In addition to any other existing examination-of-r ecords authority, Mercy Corps and/or the United  States government is authorized to examine any r ecords of the Contractor and its subcontracts to  the extent necessary to ensure that funds, including supplies and services, available under this  Contract are not provided, directly or indirectly , to a person or entity that is actively opposing  United States or coalition forces involved in a contingency operation in which members of the  Armed Forces are actively engaged in hostilities.    11.3 The Contractor is required to include the substan ce of this clause, in subcontracts funded under this  Contract tha"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 14,
    "section": null,
    "text": "t have an estimated value over $50,000  and will be performed outside the United States,  including its outlying areas.    12. Domestic preferences for procurements     As appropriate and to the extent consistent with law, the Contractor should, to the greatest extent  practicable, provide a preference for the purchase, ac quisition, or use of goods, products, or materials  produced in the United States (including but not limite d to iron, aluminum, steel, cement, and other  manufactured products). The requirements of this secti on must be included in all contracts and purchase  orders for work or products under this Contract.     For purposes of this section:     a. ‘‘Produced in the United States’’ means, for ir on and steel products, that all manufacturing  processes, from the initial melting st age through the application of coatings, occurred in the United  States.     b. ‘‘Manufactured products’’ means items  and construction materials com posed in whole or in part  of non-ferrou"
  },
  {
    "source": "Attachment 3- Purchase Contract Sample.pdf",
    "page": 14,
    "section": null,
    "text": "s metals such as aluminum; plasti cs and polymer-based products such as polyvinyl  chloride pipe; aggregates such as concrete; glass, including optical fiber; and lumber.     13. The Contractor agrees to incorporate the terms, except for Term 11 - Prohibition on Providing  Funds to the Enemy , of this schedule word-for-word in all of its subcontracts funded under this  Contract, if any.  Term 11 is to be incor porated into subcontracts in accordance with the  requirements of the term."
  }
]